alvroble/ESP32-S3-ePaper-1.54G/Example/ESP-IDF_5.5.1/09_E_Paper_Test/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_CTRL_HW_CCA_VAL=20
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_FATFS_LFN_HEAP=y

# mbedTLS
CONFIG_MBEDTLS_DEBUG=y
CONFIG_MBEDTLS_DEBUG_LEVEL_VERBOSE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# LVGL
CONFIG_LV_MEM_SIZE_KILOBYTES=64
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_BAR=y
CONFIG_LV_USE_LINE=y
CONFIG_LV_USE_ARC=y
CONFIG_LV_USE_OBJ=y
CONFIG_LV_USE_STYLE=y
CONFIG_LV_USE_THEME_DEFAULT=y
CONFIG_LV_USE_CHART=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_DRAW_BUF_STRIDE_ALIGN=y
CONFIG_LV_DRAW_BUF_ALIGN=16
CONFIG_LV_USE_ASSERT_MEM_INTEGRITY=n
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n
CONFIG_LV_USE_SNAPSHOT=n
CONFIG_LV_USE_DRAW_SW=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_)}"

# Disable IPv6 to prevent DNS/connect timeouts on IPv4-only networks
CONFIG_LWIP_IPV6=n

# Enable maximum log level compile-time support for debugging
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_LOG_MAXIMUM_LEVEL=5
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3


